In [1]:
%load_ext sql

<img src ='SQL-question.png'>

<img src ='sql schema.png'>

In [2]:
%sql sqlite:///sql-murder-mystery.db

In [6]:
%%sql
SELECT name 
FROM sqlite_master
where type = 'table'

 * sqlite:///sql-murder-mystery.db
Done.

[('crime_scene_report',),
 ('drivers_license',),
 ('person',),
 ('facebook_event_checkin',),
 ('interview',),
 ('get_fit_now_member',),
 ('get_fit_now_check_in',),
 ('income',),
 ('solution',)]

In [7]:
%%sql
SELECT *
FROM crime_scene_report 
LIMIT 5

 * sqlite:///sql-murder-mystery.db
Done.

[(20180115, 'robbery', 'A Man Dressed as Spider-Man Is on a Robbery Spree', 'NYC'),
 (20180115, 'murder', 'Life? Dont talk to me about life.', 'Albany'),
 (20180115, 'murder', 'Mama, I killed a man, put a gun against his head...', 'Reno'),
 (20180215, 'murder', 'REDACTED REDACTED REDACTED', 'SQL City'),
 (20180215, 'murder', 'Someone killed the guard! He took an arrow to the knee!', 'SQL City')]

In [8]:
%%sql
SELECT *
FROM crime_scene_report 
WHERE city == 'SQL City' and date == '20180115'

 * sqlite:///sql-murder-mystery.db
Done.

[(20180115, 'assault', 'Hamilton: Lee, do you yield? Burr: You shot him in the side! Yes he yields!', 'SQL City'),
 (20180115, 'assault', 'Report Not Found', 'SQL City'),
 (20180115, 'murder', 'Security footage shows that there were 2 witnesses. The first witness lives at the last house on "Northwestern Dr". The second witness, named Annabel, lives somewhere on "Franklin Ave".', 'SQL City')]

In [10]:
%%sql
SELECT *
FROM crime_scene_report 
WHERE city == 'SQL City' and date == '20180115'

 * sqlite:///sql-murder-mystery.db
Done.

[(20180115, 'assault', 'Hamilton: Lee, do you yield? Burr: You shot him in the side! Yes he yields!', 'SQL City'),
 (20180115, 'assault', 'Report Not Found', 'SQL City'),
 (20180115, 'murder', 'Security footage shows that there were 2 witnesses. The first witness lives at the last house on "Northwestern Dr". The second witness, named Annabel, lives somewhere on "Franklin Ave".', 'SQL City')]

In [33]:
%%sql
SELECT *
FROM person as p
JOIN interview as i
ON i.person_id = p.id
WHERE (name like '%Annabel%') AND (address_street_name == 'Franklin Ave')

 * sqlite:///sql-murder-mystery.db
Done.

[(16371, 'Annabel Miller', 490173, 103, 'Franklin Ave', 318771143, 16371, 'I saw the murder happen, and I recognized the killer from my gym when I was working out last week on January the 9th.')]

In [39]:
%%sql
SELECT *
FROM person as p
JOIN interview as i
ON i.person_id = p.id
WHERE address_street_name == 'Northwestern Dr'
ORDER BY address_number DESC
LIMIT 1

 * sqlite:///sql-murder-mystery.db
Done.

[(14887, 'Morty Schapiro', 118009, 4919, 'Northwestern Dr', 111564949, 14887, 'I heard a gunshot and then saw a man run out. He had a "Get Fit Now Gym" bag. The membership number on the bag started with "48Z". Only gold members have those bags. The man got into a car with a plate that included "H42W".')]

In [46]:
%%sql
SELECT * 
FROM get_fit_now_check_in as gc
JOIN get_fit_now_member as gm
ON gc.membership_id == gm.id
WHERE (check_in_date == '20180109') and (membership_status == 'gold') and (gm.id like '48Z%')

 * sqlite:///sql-murder-mystery.db
Done.

[('48Z7A', 20180109, 1600, 1730, '48Z7A', 28819, 'Joe Germuska', 20160305, 'gold'),
 ('48Z55', 20180109, 1530, 1700, '48Z55', 67318, 'Jeremy Bowers', 20160101, 'gold')]

In [53]:
%%sql
SELECT * 
FROM get_fit_now_member as gm
JOIN person as p
ON p.id == gm.person_id
WHERE p.name == "Joe Germuska" OR p.name == "Jeremy Bowers"

 * sqlite:///sql-murder-mystery.db
Done.

[('48Z7A', 28819, 'Joe Germuska', 20160305, 'gold', 28819, 'Joe Germuska', 173289, 111, 'Fisk Rd', 138909730),
 ('48Z55', 67318, 'Jeremy Bowers', 20160101, 'gold', 67318, 'Jeremy Bowers', 423327, 530, 'Washington Pl, Apt 3A', 871539279)]

In [59]:
%%sql
SELECT * 
FROM person as p
JOIN drivers_license as dl
ON p.license_id == dl.id
WHERE dl.id == 173289 OR dl.id == 423327

 * sqlite:///sql-murder-mystery.db
Done.

[(67318, 'Jeremy Bowers', 423327, 530, 'Washington Pl, Apt 3A', 871539279, 423327, 30, 70, 'brown', 'brown', 'male', '0H42W2', 'Chevrolet', 'Spark LS')]

Jeremy Bowers is the murderer